In [2]:
import pandas as pd
import numpy as np

In [4]:
sch = pd.read_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_schedule_2.csv")
sch.head()

   Unnamed: 0 ord_airport dest_airport depart_time arr_time        day
0           0         BTR          ATL        7:27     9:57  2023-02-2
1           1         BTR          ATL        8:28    10:46  2023-02-2
2           2         BTR          IAH       16:49    18:01  2023-02-2
3           3         BTR          DFW       17:47    19:19  2023-02-2
4           4         BTR          IAH       11:39    13:04  2023-02-2

In [9]:
status = ('Scheduled','Delayed','Departed','In Air',
 'Expected','Diverted','Recovery','Landed',
 'Arrived','Cancelled','No Takeoff','Past Flight')

In [13]:
# sch.shape
flight_call = [i for i in range(1,5191)]
sch_id = list(sch['Unnamed: 0'])
sts = ['']*5190

flight_tbl = pd.DataFrame({'flight_call':flight_call, 'schedule_id':sch_id, 'status':sts})
flight_tbl.head()

   flight_call  schedule_id status
0            1            0
1            2            1
2            3            2
3            4            3
4            5            4

In [15]:
flight_tbl.to_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_flights.csv")

In [16]:
flight_tbl.shape

(5190, 3)

In [ ]:
for i in range(1,24):

In [17]:
flights = pd.read_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/flights.csv")
flights.head()

C:\Users\miles.MILE-BL-4766-LA.000\AppData\Local\Temp\ipykernel_26604\3461807969.py:1: DtypeWarning: Columns (7,8) have mixed types. Specify dtype option on import or set low_memory=False.
  flights = pd.read_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/flights.csv")

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,ARRIVAL_TIME,ARRIVAL_DELAY,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY
0,2015,1,1,4,AS,98,N407AS,ANC,SEA,5,...,408.0,-22.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,2015,1,1,4,AA,2336,N3KUAA,LAX,PBI,10,...,741.0,-9.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
2,2015,1,1,4,US,840,N171US,SFO,CLT,20,...,811.0,5.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
3,2015,1,1,4,AA,258,N3HYAA,LAX,MIA,20,...,756.0,-9.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,2015,1,1,4,AS,135,N527AS,SEA,ANC,25,...,259.0,-21.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [34]:
# airline_data=flights[(flights[['AIRLINE','MONTH']]==['EV',1])]
airline_data=flights[(flights['AIRLINE']=='EV') & (flights['MONTH'] == 1)]

airline_data.head()

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,ARRIVAL_TIME,ARRIVAL_DELAY,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY
72,2015,1,1,4,EV,4354,N12142,MKE,IAH,515,...,826.0,13.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
76,2015,1,1,4,EV,4685,N26545,BRO,IAH,520,...,629.0,-5.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
77,2015,1,1,4,EV,5583,N882AS,VPS,ATL,520,...,711.0,-15.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
81,2015,1,1,4,EV,5187,N720EV,BNA,ATL,525,...,735.0,5.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
87,2015,1,1,4,EV,5764,N832AS,SBN,ORD,530,...,511.0,-14.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [35]:
airline_data.shape

(49925, 31)

In [36]:
airline_data.columns

Index(['YEAR', 'MONTH', 'DAY', 'DAY_OF_WEEK', 'AIRLINE', 'FLIGHT_NUMBER',
       'TAIL_NUMBER', 'ORIGIN_AIRPORT', 'DESTINATION_AIRPORT',
       'SCHEDULED_DEPARTURE', 'DEPARTURE_TIME', 'DEPARTURE_DELAY', 'TAXI_OUT',
       'WHEELS_OFF', 'SCHEDULED_TIME', 'ELAPSED_TIME', 'AIR_TIME', 'DISTANCE',
       'WHEELS_ON', 'TAXI_IN', 'SCHEDULED_ARRIVAL', 'ARRIVAL_TIME',
       'ARRIVAL_DELAY', 'DIVERTED', 'CANCELLED', 'CANCELLATION_REASON',
       'AIR_SYSTEM_DELAY', 'SECURITY_DELAY', 'AIRLINE_DELAY',
       'LATE_AIRCRAFT_DELAY', 'WEATHER_DELAY'],
      dtype='object')

In [66]:
airline_data = airline_data[['YEAR', 'MONTH', 'DAY','FLIGHT_NUMBER','TAIL_NUMBER', 
        'ORIGIN_AIRPORT', 'DESTINATION_AIRPORT', 'DEPARTURE_TIME', 'ARRIVAL_TIME','AIRLINE','DISTANCE',
       'SCHEDULED_DEPARTURE','SCHEDULED_TIME', 'AIR_TIME', 'SCHEDULED_ARRIVAL', 'CANCELLED']].dropna()
airline_data.head()

,YEAR,MONTH,DAY,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,DEPARTURE_TIME,ARRIVAL_TIME,AIRLINE,DISTANCE,SCHEDULED_DEPARTURE,SCHEDULED_TIME,AIR_TIME,SCHEDULED_ARRIVAL,CANCELLED
72,2015,1,1,4354,N12142,MKE,IAH,517.0,826.0,EV,984,515,178.0,163.0,813,0
76,2015,1,1,4685,N26545,BRO,IAH,517.0,629.0,EV,308,520,74.0,49.0,634,0
77,2015,1,1,5583,N882AS,VPS,ATL,514.0,711.0,EV,250,520,66.0,42.0,726,0
81,2015,1,1,5187,N720EV,BNA,ATL,525.0,735.0,EV,214,525,65.0,35.0,730,0
87,2015,1,1,5764,N832AS,SBN,ORD,527.0,511.0,EV,84,530,55.0,22.0,525,0

In [68]:
airline_data.shape

(48084, 16)

In [67]:
airline_data['FLIGHT_NUMBER'].value_counts()

2570    66
2572    62
2527    62
4208    62
2523    62
        ..
5699     1
5522     1
3850     1
4455     1
5728     1
Name: FLIGHT_NUMBER, Length: 1853, dtype: int64

In [69]:
tail_nums = list(airline_data['TAIL_NUMBER'].value_counts().index[:323])

In [83]:
airline_data['TAIL_NUMBER'].value_counts()

N909EV    221
N880AS    221
N904EV    215
N876AS    211
N902EV    200
         ...
N14953     23
N841AS     23
N200PQ     19
N14153     17
N16151     11
Name: TAIL_NUMBER, Length: 373, dtype: int64

In [90]:
airline_data[airline_data['TAIL_NUMBER']=='N16571']#['FLIGHT_NUMBER'].value_counts()

,YEAR,MONTH,DAY,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,DEPARTURE_TIME,ARRIVAL_TIME,AIRLINE,DISTANCE,SCHEDULED_DEPARTURE,SCHEDULED_TIME,AIR_TIME,SCHEDULED_ARRIVAL,CANCELLED
1459,2015,1,1,4258,N16571,CLT,IAH,748.0,954.0,EV,912,746,179.0,157.0,945,0
3694,2015,1,1,4490,N16571,IAH,GSP,1022.0,1320.0,EV,837,1022,126.0,103.0,1328,0
7066,2015,1,1,4179,N16571,GSP,IAH,1351.0,1540.0,EV,837,1358,165.0,151.0,1543,0
9390,2015,1,1,4699,N16571,IAH,MEM,1626.0,1802.0,EV,468,1625,91.0,68.0,1756,0
11238,2015,1,1,3938,N16571,MEM,ORD,1828.0,2012.0,EV,491,1826,114.0,82.0,2020,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
448102,2015,1,30,5779,N16571,IAH,HRL,1129.0,1247.0,EV,295,1133,72.0,54.0,1245,0
449990,2015,1,30,4102,N16571,HRL,IAH,1315.0,1434.0,EV,295,1326,74.0,52.0,1440,0
452252,2015,1,30,4764,N16571,IAH,CVG,1540.0,1855.0,EV,871,1544,139.0,114.0,1903,0
456078,2015,1,30,4352,N16571,CVG,EWR,2030.0,2230.0,EV,569,1933,118.0,90.0,2131,0
466005,2015,1,31,4580,N16571,EWR,MKE,1539.0,1708.0,EV,725,1517,153.0,133.0,1650,0

In [72]:
all_flights = airline_data[airline_data['TAIL_NUMBER'].isin(tail_nums)].dropna()#['DAY'].value_counts()
all_flights.shape

(44716, 16)

In [75]:
all_flights[all_flights['DAY']==6]

,YEAR,MONTH,DAY,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,DEPARTURE_TIME,ARRIVAL_TIME,AIRLINE,DISTANCE,SCHEDULED_DEPARTURE,SCHEDULED_TIME,AIR_TIME,SCHEDULED_ARRIVAL,CANCELLED
79087,2015,1,6,5326,N608QX,BIS,MSP,458.0,623.0,EV,386,500,85.0,57.0,625,0
79112,2015,1,6,4098,N16571,MAF,IAH,509.0,639.0,EV,429,515,85.0,56.0,640,0
79113,2015,1,6,4418,N17108,MSP,IAH,505.0,758.0,EV,1034,515,185.0,140.0,820,0
79124,2015,1,6,4288,N14117,MFE,IAH,507.0,613.0,EV,316,520,72.0,47.0,632,0
79128,2015,1,6,4671,N34110,HRL,IAH,520.0,619.0,EV,295,521,72.0,46.0,633,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
94101,2015,1,6,5831,N15912,IAD,SYR,2202.0,2307.0,EV,296,2158,79.0,46.0,2317,0
94121,2015,1,6,5042,N925EV,ATL,CAE,2156.0,2253.0,EV,192,2200,59.0,34.0,2259,0
94124,2015,1,6,5292,N979EV,ATL,AVL,2258.0,2342.0,EV,164,2201,52.0,31.0,2253,0
94145,2015,1,6,5350,N927EV,ATL,TRI,2204.0,2300.0,EV,227,2208,66.0,39.0,2314,0
94181,2015,1,6,5675,N12569,EWR,ORF,2247.0,19.0,EV,284,2223,79.0,54.0,2342,0

In [ ]:
# flight aircraft

In [113]:
flight_aircraft = all_flights[['FLIGHT_NUMBER','TAIL_NUMBER']].drop_duplicates()
flight_aircraft.shape

(31995, 2)

In [114]:
flight_aircraft.head()

    FLIGHT_NUMBER TAIL_NUMBER
76           4685      N26545
77           5583      N882AS
81           5187      N720EV
87           5764      N832AS
98           4557      N12967

In [ ]:
# flights, schedule

In [97]:
temp_sch = all_flights[['DAY','FLIGHT_NUMBER', 
        'ORIGIN_AIRPORT', 'DESTINATION_AIRPORT', 
             'DEPARTURE_TIME', 'ARRIVAL_TIME','DISTANCE']].drop_duplicates()
temp_sch.shape

(44716, 7)

In [99]:
temp_sch['schedule_id'] = [i for i in range(1,44717)]

In [101]:
temp_sch['date'] = ['2023-01-'+str(i) for i in temp_sch['DAY']]

In [102]:
temp_sch = temp_sch[['DAY','date','schedule_id','FLIGHT_NUMBER', 
        'ORIGIN_AIRPORT', 'DESTINATION_AIRPORT', 
             'DEPARTURE_TIME', 'ARRIVAL_TIME','DISTANCE']]

In [103]:
temp_sch.head()

,DAY,date,schedule_id,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,DEPARTURE_TIME,ARRIVAL_TIME,DISTANCE
76,1,2023-01-1,1,4685,BRO,IAH,517.0,629.0,308
77,1,2023-01-1,2,5583,VPS,ATL,514.0,711.0,250
81,1,2023-01-1,3,5187,BNA,ATL,525.0,735.0,214
87,1,2023-01-1,4,5764,SBN,ORD,527.0,511.0,84
98,1,2023-01-1,5,4557,CRP,IAH,523.0,615.0,201

In [104]:
temp_flghts = temp_sch[['FLIGHT_NUMBER','schedule_id']]
temp_flghts.head()

    FLIGHT_NUMBER  schedule_id
76           4685            1
77           5583            2
81           5187            3
87           5764            4
98           4557            5

In [106]:
temp_flghts['status'] = ['' for i in range(44716)]

C:\Users\miles.MILE-BL-4766-LA.000\AppData\Local\Temp\ipykernel_26604\3930380971.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp_flghts['status'] = ['' for i in range(44716)]

In [107]:
temp_flghts.head()

    FLIGHT_NUMBER  schedule_id status
76           4685            1
77           5583            2
81           5187            3
87           5764            4
98           4557            5

In [116]:
temp_sch.head()

,DAY,date,schedule_id,FLIGHT_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,DEPARTURE_TIME,ARRIVAL_TIME,DISTANCE
76,1,2023-01-1,1,4685,BRO,IAH,517.0,629.0,308
77,1,2023-01-1,2,5583,VPS,ATL,514.0,711.0,250
81,1,2023-01-1,3,5187,BNA,ATL,525.0,735.0,214
87,1,2023-01-1,4,5764,SBN,ORD,527.0,511.0,84
98,1,2023-01-1,5,4557,CRP,IAH,523.0,615.0,201

In [117]:
full_sch = temp_sch[['date','schedule_id', 'ORIGIN_AIRPORT','DESTINATION_AIRPORT','DEPARTURE_TIME','ARRIVAL_TIME']]
full_sch.shape

(44716, 6)

In [118]:
full_sch.head()

,date,schedule_id,ORIGIN_AIRPORT,DESTINATION_AIRPORT,DEPARTURE_TIME,ARRIVAL_TIME
76,2023-01-1,1,BRO,IAH,517.0,629.0
77,2023-01-1,2,VPS,ATL,514.0,711.0
81,2023-01-1,3,BNA,ATL,525.0,735.0
87,2023-01-1,4,SBN,ORD,527.0,511.0
98,2023-01-1,5,CRP,IAH,523.0,615.0

In [120]:
def timesep(x):
    tx = str(x).split('.')[0]
    return tx[:-2] + ':' + tx[-2:]

full_sch['DEPARTURE_TIME'] = full_sch['DEPARTURE_TIME'].apply(lambda x: timesep(x) )
full_sch['ARRIVAL_TIME'] = full_sch['ARRIVAL_TIME'].apply(lambda x: timesep(x) )
full_sch.head()

C:\Users\miles.MILE-BL-4766-LA.000\AppData\Local\Temp\ipykernel_26604\619158503.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  full_sch['DEPARTURE_TIME'] = full_sch['DEPARTURE_TIME'].apply(lambda x: timesep(x) )
C:\Users\miles.MILE-BL-4766-LA.000\AppData\Local\Temp\ipykernel_26604\619158503.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  full_sch['ARRIVAL_TIME'] = full_sch['ARRIVAL_TIME'].apply(lambda x: timesep(x) )

,date,schedule_id,ORIGIN_AIRPORT,DESTINATION_AIRPORT,DEPARTURE_TIME,ARRIVAL_TIME
76,2023-01-1,1,BRO,IAH,5:17,6:29
77,2023-01-1,2,VPS,ATL,5:14,7:11
81,2023-01-1,3,BNA,ATL,5:25,7:35
87,2023-01-1,4,SBN,ORD,5:27,5:11
98,2023-01-1,5,CRP,IAH,5:23,6:15

In [ ]:
# directions

In [129]:
temp_dirs = temp_sch[['ORIGIN_AIRPORT','DESTINATION_AIRPORT','DISTANCE']].drop_duplicates()
temp_dirs.head()

   ORIGIN_AIRPORT DESTINATION_AIRPORT  DISTANCE
76            BRO                 IAH       308
77            VPS                 ATL       250
81            BNA                 ATL       214
87            SBN                 ORD        84
98            CRP                 IAH       201

In [128]:
len(temp_sch['ORIGIN_AIRPORT'].unique()),len(temp_sch['DESTINATION_AIRPORT'].unique())

(166, 166)

In [134]:
# aircraft

In [135]:
temp_airc = pd.read_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_aircraft.csv")
temp_airc.head()

   Unnamed: 0           model  seats mft_id aircraft_id
0         938         767-201    255     M3          A1
1        3077  DC-9-83(MD-83)    172    M19          A2
2        2283         757-2B7    178     M3          A3
3        1088         737-3K2    149     M3          A4
4        1088         737-3K2    149     M3          A5

In [136]:
temp_airc.shape

(500, 5)

In [137]:
temp_airc.sort_values('seats')

     Unnamed: 0    model  seats mft_id aircraft_id
387        3156  DC-9-51    139    M19        A388
422        2140  737-8H4    140     M3        A423
36         2140  737-8H4    140     M3         A37
222        2140  737-8H4    140     M3        A223
154        2140  737-8H4    140     M3        A155
..          ...      ...    ...    ...         ...
5          1847  747-451    450     M3          A6
212        1847  747-451    450     M3        A213
423        1847  747-451    450     M3        A424
412        1847  747-451    450     M3        A413
256        1847  747-451    450     M3        A257

[500 rows x 5 columns]

In [133]:
flight_aircraft.to_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_flight_aircraft.csv")

In [130]:
temp_flghts.to_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_flights_ev.csv")

In [131]:
temp_dirs.to_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_directions_ev.csv")

In [132]:
full_sch.to_csv("C:/Users/miles.MILE-BL-4766-LA.000/Documents/FT/airline_data/tbl_schedule_ev.csv")